Revit 2027 API
ParameterTypeId.SteelElemBoltDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemBoltDiameter { get; }
Public Shared ReadOnly Property SteelElemBoltDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemBoltDiameter {
	ForgeTypeId^ get ();
}
static member SteelElemBoltDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace